Revit 2027 API
AnalyticalElement.GetTransform Method
 Returns the transform which reflects Analytical Element orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetTransform()
Public Function GetTransform As Transform
public:
Transform^ GetTransform()
member GetTransform : unit -> Transform
Return Value
Transform
 The orientation of the Analytical Element.
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace